tutorials/incompressibleFluid/venturiTube/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc probes
(
    name=probes,
    points=
    (
        (0.05 0.05  0)
        (0.25 0.025 0)
    ),
    p
)

#include "graphs"
#includeFunc residuals(name=residuals, fields=(p U))

// ************************************************************************* //
